Repository: lexo-ch/webp-converter
Catalog: languages/webpc-*.po
Languages: de_de

source: %s Control
de_de: %s Kontrolle

source: Applies to WebP image created from uploaded JPG/JPEG image. Acceptable values range from %d to %d.
de_de: Gilt für WebP-Bilder, die aus hochgeladenen JPG-/JPEG-Bildern erstellt wurden. Zulässige Werte liegen zwischen %d und %d.

source: Automatically converts images to WebP format upon upload.
de_de: Konvertiert Bilder beim Hochladen automatisch in das WebP-Format.

source: Backup original image without scaling or compression
de_de: Originalbild ohne Skalierung oder Komprimierung sichern

source: Backups won't be created in cases when original image is WebP or option "Keep smaller image" is enabled and original image is smaller than converted WebP (and therefore we keep original instead of WebP).
de_de: Es werden keine Backups erstellt, wenn das Originalbild WebP ist oder die Option „Kleineres Bild behalten“ aktiviert ist und das Originalbild kleiner als das konvertierte WebP ist (und wir daher das Original anstelle von WebP behalten).

source: Compression quality settings
de_de: Einstellungen für die Komprimierungsqualität

source: Disable Image Optimization
de_de: Bildoptimierung deaktivieren

source: Enable Image Optimization
de_de: Bildoptimierung aktivieren

source: If you disable image optimization, uploaded images will not be automatically converted and optimized for the web in WebP format for <strong>%s</strong>. The function will then be automatically reactivated. You can enable image optimization at any time before this period expires.
de_de: Wenn Sie die Bildoptimierung deaktivieren, werden hochgeladene Bilder <strong>%s</strong> lang nicht automatisch im WebP-Format konvertiert und für das Web optimiert. Anschliessend wird die Funktion automatisch wieder aktiviert. Sie können die Bildoptimierung jederzeit vor Ablauf dieses Zeitraums aktivieren.

source: Image compression in percentages.
de_de: Bildkomprimierung in Prozent.

source: Keep smaller image (WebP or original, whatever is smaller)
de_de: Kleineres Bild behalten (WebP oder Original, je nachdem, was kleiner ist)

source: Manually check for update
de_de: Manuell nach Updates suchen

source: Next automatic update check at <b>%s</b>.
de_de: Nächste automatische Updateprüfung um <b>%s</b>.

source: Plugin %s is up to date.
de_de: Plugin %s ist aktuell.

source: Save settings
de_de: Einstellungen speichern

source: Scale down uploaded images.
de_de: Hochgeladene Bilder verkleinern.

source: Security check failed.
de_de: Sicherheitsüberprüfung fehlgeschlagen.

source: Settings
de_de: Einstellungen

source: The %s plugin (<b>image optimization</b>) is temporarily disabled until <b>%s</b>.
de_de: Das %s-Plugin (<b>Bildoptimierung</b>) ist bis <b>%s</b> vorübergehend deaktiviert.

source: The GD PHP extension is required for the LEXO WebP Converter plugin to work.
de_de: Damit das LEXO WebP Converter-Plugin funktioniert, ist die GD PHP-Erweiterung erforderlich.

source: The settings for the %s have been successfully saved.
de_de: Die Einstellungen für %s wurden erfolgreich gespeichert.

source: The value of the <a href="%s">"large" image size width</a> (<b>%d</b>) is larger than the <a href="%s">value used for scaling</a> (<b>%d</b>) in %s plugin. This could lead to potential issues.
de_de: Der Wert der <a href="%s">Bildgröße "groß"</a> (<b>%d</b>) ist größer als der <a href="%s">für die Skalierung verwendete Wert</a> (<b>%d</b>) im %s-Plugin. Dies könnte zu potenziellen Problemen führen.

source: This setting affects all uploaded images, no matter what type they are. If an image is wider or taller than the limit we set, it will automatically be scaled down to fit within this limit. The starting point for this limit is the larger of two values: <a href="%s">the width set for "large" image size</a>, or %d. You can choose any value within the range of %d (the larger of the "large" image size width or %d) to %d.
de_de: Diese Einstellung betrifft alle hochgeladenen Bilder, unabhängig vom Typ. Überschreitet ein Bild die von uns festgelegte Breite oder Höhe, wird es automatisch verkleinert, um in diese Breite zu passen. Ausgangspunkt für diese Breite ist der grössere von zwei Werten: <a href="%s">die für die Bildgrösse „gross“ festgelegte Breite</a> oder %d. Sie können einen beliebigen Wert zwischen %d (der grössere Wert aus „gross“ oder %d) und %d wählen.

source: This user doesn't have permission to run this plugin.
de_de: Dieser Benutzer hat keine Berechtigung, dieses Plugin auszuführen.
